import React, { Component } from 'react';
import { Card, Input } from 'antd';
import { nanoid } from 'nanoid';
import { ConstructGraph } from './ConstructGraph';
import '../style/style.css'

const { Search } = Input;
class QualityGraph extends Component {
    state = {
        data: {
            nodes: [
                {
                    "id": "2021-06-16_10:07:19",
                    "label": "2021-06-16_10:07:19",
                    "name": "2021-06-16_10:07:19",
                    "group": 9
                },
                {
                    "id": "焊接工件1",
                    "label": "焊接工件1",
                    "name": "焊接工件1",
                    "group": 8
                },
                {
                    "id": "原材料",
                    "label": "原材料",
                    "name": "原材料",
                    "group": 7
                },
                {
                    "id": "高温合金钢GH3628",
                    "label": "高温合金钢GH3628",
                    "name": "高温合金钢GH3628",
                    "group": 7
                },
                {
                    "id": "焊缝数量",
                    "label": "焊缝数量",
                    "name": "焊缝数量",
                    "group": 7
                },
                {
                    "id": "焊接",
                    "label": "焊接",
                    "name": "焊接",
                    "group": 7
                },
                {
                    "id": "壳体尺寸信息",
                    "label": "壳体尺寸信息",
                    "name": "壳体尺寸信息",
                    "group": 1
                },
                {
                    "id": "焊缝正面余高",
                    "label": "焊缝正面余高",
                    "name": "焊缝正面余高",
                    "group": 4
                },
                {
                    "id": "真空度",
                    "label": "真空度",
                    "name": "真空度",
                    "group": 3
                },
                {
                    "id": "加速电压",
                    "label": "加速电压",
                    "name": "加速电压",
                    "group": 9
                },
                {
                    "id": "电子束流",
                    "label": "电子束流",
                    "name": "电子束流",
                    "group": 2
                },
                {
                    "id": "电子聚焦量",
                    "label": "电子聚焦量",
                    "name": "电子聚焦量",
                    "group": 8
                },
                {
                    "id": "-891",
                    "label": "-891",
                    "name": "-891",
                    "group": 5
                },
                {
                    "id": "130",
                    "label": "130",
                    "name": "130",
                    "group": 3
                },
                {
                    "id": "0.165",
                    "label": "0.165",
                    "name": "0.165",
                    "group": 8
                },
                {
                    "id": "2034",
                    "label": "2034",
                    "name": "2034",
                    "group": 5
                },
                {
                    "id": "2021-06-16_10:22:19",
                    "label": "2021-06-16_10:22:19",
                    "name": "2021-06-16_10:22:19",
                    "group": 4
                },
                {
                    "id": "表面缺陷",
                    "label": "表面缺陷",
                    "name": "表面缺陷",
                    "group": 7
                },
                {
                    "id": "气孔",
                    "label": "气孔",
                    "name": "气孔",
                    "group": 1
                },
                {
                    "id": "焊接图像",
                    "label": "焊接图像",
                    "name": "焊接图像",
                    "group": 5
                },
                {
                    "id": "缺陷特征",
                    "label": "缺陷特征",
                    "name": "缺陷特征",
                    "group": 3
                },
                {
                    "id": "焊接图像缺陷检测",
                    "label": "焊接图像缺陷检测",
                    "name": "焊接图像缺陷检测",
                    "group": 3
                },
                {
                    "id": "真空电子束焊机",
                    "label": "真空电子束焊机",
                    "name": "真空电子束焊机",
                    "group": 2
                },
                {
                    "id": "工作距离",
                    "label": "工作距离",
                    "name": "工作距离",
                    "group": 4
                },
                {
                    "id": "聚焦电流",
                    "label": "聚焦电流",
                    "name": "聚焦电流",
                    "group": 5
                },
                {
                    "id": "焊接速度",
                    "label": "焊接速度",
                    "name": "焊接速度",
                    "group": 10
                },
                {
                    "id": "激光功率",
                    "label": "激光功率",
                    "name": "激光功率",
                    "group": 1
                },
                {
                    "id": "离焦量",
                    "label": "离焦量",
                    "name": "离焦量",
                    "group": 5
                },
                {
                    "id": "电子枪功率",
                    "label": "电子枪功率",
                    "name": "电子枪功率",
                    "group": 3
                },
                {
                    "id": "15kW",
                    "label": "15kW",
                    "name": "15kW",
                    "group": 3
                },
                {
                    "id": "电子枪加速电压",
                    "label": "电子枪加速电压",
                    "name": "电子枪加速电压",
                    "group": 5
                },
                {
                    "id": "60kW",
                    "label": "60kW",
                    "name": "60kW",
                    "group": 3
                },
                {
                    "id": "电子束最大束流",
                    "label": "电子束最大束流",
                    "name": "电子束最大束流",
                    "group": 1
                },
                {
                    "id": "250mA",
                    "label": "250mA",
                    "name": "250mA",
                    "group": 8
                },
                {
                    "id": "真空获得时间",
                    "label": "真空获得时间",
                    "name": "真空获得时间",
                    "group": 2
                },
                {
                    "id": "15min",
                    "label": "15min",
                    "name": "15min",
                    "group": 10
                },
                {
                    "id": "真空室真空度",
                    "label": "真空室真空度",
                    "name": "真空室真空度",
                    "group": 5
                },
                {
                    "id": "0.05Pa",
                    "label": "0.05Pa",
                    "name": "0.05Pa",
                    "group": 5
                },
                {
                    "id": "焊接工件",
                    "label": "焊接工件",
                    "name": "焊接工件",
                    "group": 9
                },
                {
                    "id": "阴极使用寿命模型",
                    "label": "阴极使用寿命模型",
                    "name": "阴极使用寿命模型",
                    "group": 9
                },
                {
                    "id": "旋压加工",
                    "label": "旋压加工",
                    "name": "旋压加工",
                    "group": 3
                },
                {
                    "id": "旋压成型质量检测",
                    "label": "旋压成型质量检测",
                    "name": "旋压成型质量检测",
                    "group": 2
                },
                {
                    "id": "产品批次号",
                    "label": "产品批次号",
                    "name": "产品批次号",
                    "group": 6
                },
                {
                    "id": "焊接图号",
                    "label": "焊接图号",
                    "name": "焊接图号",
                    "group": 5
                },
                {
                    "id": "壳体直径",
                    "label": "壳体直径",
                    "name": "壳体直径",
                    "group": 1
                },
                {
                    "id": "壳体壁厚",
                    "label": "壳体壁厚",
                    "name": "壳体壁厚",
                    "group": 7
                },
                {
                    "id": "壳体长度",
                    "label": "壳体长度",
                    "name": "壳体长度",
                    "group": 9
                },
                {
                    "id": "壳体位置",
                    "label": "壳体位置",
                    "name": "壳体位置",
                    "group": 6
                },
                {
                    "id": "焊缝要求",
                    "label": "焊缝要求",
                    "name": "焊缝要求",
                    "group": 6
                },
                {
                    "id": "焊接工件2",
                    "label": "焊接工件2",
                    "name": "焊接工件2",
                    "group": 10
                },
                {
                    "id": "质量信息",
                    "label": "质量信息",
                    "name": "质量信息",
                    "group": 3
                },
                {
                    "id": "待焊尺寸信息",
                    "label": "待焊尺寸信息",
                    "name": "待焊尺寸信息",
                    "group": 1
                },
                {
                    "id": "焊缝结构",
                    "label": "焊缝结构",
                    "name": "焊缝结构",
                    "group": 6
                },
                {
                    "id": "待焊部位直径",
                    "label": "待焊部位直径",
                    "name": "待焊部位直径",
                    "group": 8
                },
                {
                    "id": "待焊部位壁厚",
                    "label": "待焊部位壁厚",
                    "name": "待焊部位壁厚",
                    "group": 8
                },
                {
                    "id": "待焊等级要求",
                    "label": "待焊等级要求",
                    "name": "待焊等级要求",
                    "group": 2
                },
                {
                    "id": "焊接参数",
                    "label": "焊接参数",
                    "name": "焊接参数",
                    "group": 3
                },
                {
                    "id": "设备信息",
                    "label": "设备信息",
                    "name": "设备信息",
                    "group": 6
                },
                {
                    "id": "焊接电流",
                    "label": "焊接电流",
                    "name": "焊接电流",
                    "group": 4
                },
                {
                    "id": "阴极使用时间",
                    "label": "阴极使用时间",
                    "name": "阴极使用时间",
                    "group": 7
                },
                {
                    "id": "焊缝背面余高",
                    "label": "焊缝背面余高",
                    "name": "焊缝背面余高",
                    "group": 6
                },
                {
                    "id": "焊缝内部质量33",
                    "label": "焊缝内部质量33",
                    "name": "焊缝内部质量33",
                    "group": 5
                },
                {
                    "id": "焊缝力学性能34",
                    "label": "焊缝力学性能34",
                    "name": "焊缝力学性能34",
                    "group": 3
                },
                {
                    "id": "焊缝质量信息",
                    "label": "焊缝质量信息",
                    "name": "焊缝质量信息",
                    "group": 4
                },
                {
                    "id": "焊缝内部质量",
                    "label": "焊缝内部质量",
                    "name": "焊缝内部质量",
                    "group": 10
                },
                {
                    "id": "焊缝力学性能",
                    "label": "焊缝力学性能",
                    "name": "焊缝力学性能",
                    "group": 4
                },
                {
                    "id": "生产优化模型",
                    "label": "生产优化模型",
                    "name": "生产优化模型",
                    "group": 5
                },
                {
                    "id": "推荐工艺参数",
                    "label": "推荐工艺参数",
                    "name": "推荐工艺参数",
                    "group": 7
                },
                {
                    "id": "壳体尾跳",
                    "label": "壳体尾跳",
                    "name": "壳体尾跳",
                    "group": 7
                },
                {
                    "id": "壳体中跳",
                    "label": "壳体中跳",
                    "name": "壳体中跳",
                    "group": 7
                },
                {
                    "id": "旋压转速",
                    "label": "旋压转速",
                    "name": "旋压转速",
                    "group": 4
                },
                {
                    "id": "旋压进给比",
                    "label": "旋压进给比",
                    "name": "旋压进给比",
                    "group": 6
                },
                {
                    "id": "旋压圆弧半径",
                    "label": "旋压圆弧半径",
                    "name": "旋压圆弧半径",
                    "group": 9
                },
                {
                    "id": "壳体小端壁厚",
                    "label": "壳体小端壁厚",
                    "name": "壳体小端壁厚",
                    "group": 3
                },
                {
                    "id": "壳体小端内径",
                    "label": "壳体小端内径",
                    "name": "壳体小端内径",
                    "group": 10
                },
                {
                    "id": "壳体锥段壁厚",
                    "label": "壳体锥段壁厚",
                    "name": "壳体锥段壁厚",
                    "group": 1
                },
                {
                    "id": "壳体筒身壁厚",
                    "label": "壳体筒身壁厚",
                    "name": "壳体筒身壁厚",
                    "group": 2
                },
                {
                    "id": "壳体大端内径",
                    "label": "壳体大端内径",
                    "name": "壳体大端内径",
                    "group": 6
                },
                {
                    "id": "壳体大端壁厚",
                    "label": "壳体大端壁厚",
                    "name": "壳体大端壁厚",
                    "group": 1
                },
                {
                    "id": "壳体总长",
                    "label": "壳体总长",
                    "name": "壳体总长",
                    "group": 1
                },
                {
                    "id": "壳体错距",
                    "label": "壳体错距",
                    "name": "壳体错距",
                    "group": 7
                },
                {
                    "id": "旋压工作角",
                    "label": "旋压工作角",
                    "name": "旋压工作角",
                    "group": 10
                },
                {
                    "id": "高温合金钢GH4009",
                    "label": "高温合金钢GH4009",
                    "name": "高温合金钢GH4009",
                    "group": 2
                },
                {
                    "id": "5.2mm",
                    "label": "5.2mm",
                    "name": "5.2mm",
                    "group": 3
                },
                {
                    "id": "39.42mm",
                    "label": "39.42mm",
                    "name": "39.42mm",
                    "group": 1
                },
                {
                    "id": "2.49mm",
                    "label": "2.49mm",
                    "name": "2.49mm",
                    "group": 10
                },
                {
                    "id": "2.47mm",
                    "label": "2.47mm",
                    "name": "2.47mm",
                    "group": 3
                },
                {
                    "id": "69.86mm",
                    "label": "69.86mm",
                    "name": "69.86mm",
                    "group": 2
                },
                {
                    "id": "0.59mm",
                    "label": "0.59mm",
                    "name": "0.59mm",
                    "group": 2
                },
                {
                    "id": "352mm",
                    "label": "352mm",
                    "name": "352mm",
                    "group": 3
                },
                {
                    "id": "26",
                    "label": "26",
                    "name": "26",
                    "group": 3
                },
                {
                    "id": "2mm",
                    "label": "2mm",
                    "name": "2mm",
                    "group": 7
                },
                {
                    "id": "0.16",
                    "label": "0.16",
                    "name": "0.16",
                    "group": 2
                },
                {
                    "id": "2.2mm",
                    "label": "2.2mm",
                    "name": "2.2mm",
                    "group": 4
                },
                {
                    "id": "160",
                    "label": "160",
                    "name": "160",
                    "group": 4
                },
                {
                    "id": "0.1mm",
                    "label": "0.1mm",
                    "name": "0.1mm",
                    "group": 7
                },
                {
                    "id": "0.06mm",
                    "label": "0.06mm",
                    "name": "0.06mm",
                    "group": 3
                },
                {
                    "id": "5.05mm",
                    "label": "5.05mm",
                    "name": "5.05mm",
                    "group": 10
                },
                {
                    "id": "2.48mm",
                    "label": "2.48mm",
                    "name": "2.48mm",
                    "group": 4
                },
                {
                    "id": "0.6mm",
                    "label": "0.6mm",
                    "name": "0.6mm",
                    "group": 4
                },
                {
                    "id": "4mm",
                    "label": "4mm",
                    "name": "4mm",
                    "group": 3
                },
                {
                    "id": "0.26",
                    "label": "0.26",
                    "name": "0.26",
                    "group": 4
                },
                {
                    "id": "2.4mm",
                    "label": "2.4mm",
                    "name": "2.4mm",
                    "group": 4
                },
                {
                    "id": "260",
                    "label": "260",
                    "name": "260",
                    "group": 6
                },
                {
                    "id": "0.24mm",
                    "label": "0.24mm",
                    "name": "0.24mm",
                    "group": 8
                },
                {
                    "id": "0.16mm",
                    "label": "0.16mm",
                    "name": "0.16mm",
                    "group": 4
                },
                {
                    "id": "GAK12-发动机壳体",
                    "label": "GAK12-发动机壳体",
                    "name": "GAK12-发动机壳体",
                    "group": 1
                },
                {
                    "id": "正背面余高",
                    "label": "正背面余高",
                    "name": "正背面余高",
                    "group": 7
                },
                {
                    "id": "内部质量",
                    "label": "内部质量",
                    "name": "内部质量",
                    "group": 7
                },
                {
                    "id": "拉伸强度",
                    "label": "拉伸强度",
                    "name": "拉伸强度",
                    "group": 6
                },
                {
                    "id": "焊接变形",
                    "label": "焊接变形",
                    "name": "焊接变形",
                    "group": 10
                },
                {
                    "id": "-890",
                    "label": "-890",
                    "name": "-890",
                    "group": 10
                },
                {
                    "id": "0.167",
                    "label": "0.167",
                    "name": "0.167",
                    "group": 6
                },
                {
                    "id": "错边",
                    "label": "错边",
                    "name": "错边",
                    "group": 10
                },
                {
                    "id": "9MPa",
                    "label": "9MPa",
                    "name": "9MPa",
                    "group": 3
                },
                {
                    "id": "1mm",
                    "label": "1mm",
                    "name": "1mm",
                    "group": 2
                },
                {
                    "id": "has_feature",
                    "label": "has_feature",
                    "name": "has_feature",
                    "group": 4
                },
                {
                    "id": "make_a_cause",
                    "label": "make_a_cause",
                    "name": "make_a_cause",
                    "group": 3
                },
                {
                    "id": "give_a_measure",
                    "label": "give_a_measure",
                    "name": "give_a_measure",
                    "group": 5
                },
                {
                    "id": "保护气体中有水份或碳氧化合物",
                    "label": "保护气体中有水份或碳氧化合物",
                    "name": "保护气体中有水份或碳氧化合物",
                    "group": 4
                },
                {
                    "id": "焊接不稳定",
                    "label": "焊接不稳定",
                    "name": "焊接不稳定",
                    "group": 1
                },
                {
                    "id": "气体保护不良",
                    "label": "气体保护不良",
                    "name": "气体保护不良",
                    "group": 6
                },
                {
                    "id": "焊丝焊件清理不干净有油污",
                    "label": "焊丝焊件清理不干净有油污",
                    "name": "焊丝焊件清理不干净有油污",
                    "group": 4
                },
                {
                    "id": "焊接速度过高使得气不易逸出",
                    "label": "焊接速度过高使得气不易逸出",
                    "name": "焊接速度过高使得气不易逸出",
                    "group": 2
                },
                {
                    "id": "焊接冷却快使得气不易逸出",
                    "label": "焊接冷却快使得气不易逸出",
                    "name": "焊接冷却快使得气不易逸出",
                    "group": 9
                },
                {
                    "id": "氩气流量过小或喷嘴直径不合适",
                    "label": "氩气流量过小或喷嘴直径不合适",
                    "name": "氩气流量过小或喷嘴直径不合适",
                    "group": 1
                },
                {
                    "id": "焊接材料不致密",
                    "label": "焊接材料不致密",
                    "name": "焊接材料不致密",
                    "group": 8
                },
                {
                    "id": "焊丝有夹渣",
                    "label": "焊丝有夹渣",
                    "name": "焊丝有夹渣",
                    "group": 2
                },
                {
                    "id": "渣焊接垫板潮湿",
                    "label": "渣焊接垫板潮湿",
                    "name": "渣焊接垫板潮湿",
                    "group": 7
                },
                {
                    "id": "用高速钢丝轮打磨零件焊接区内外表面及接缝端面",
                    "label": "用高速钢丝轮打磨零件焊接区内外表面及接缝端面",
                    "name": "用高速钢丝轮打磨零件焊接区内外表面及接缝端面",
                    "group": 2
                },
                {
                    "id": "把零件内外表面用丙酮或无水酒精彻底清洗干净",
                    "label": "把零件内外表面用丙酮或无水酒精彻底清洗干净",
                    "name": "把零件内外表面用丙酮或无水酒精彻底清洗干净",
                    "group": 10
                },
                {
                    "id": "烧穿",
                    "label": "烧穿",
                    "name": "烧穿",
                    "group": 2
                },
                {
                    "id": "基本金属上形成孔洞",
                    "label": "基本金属上形成孔洞",
                    "name": "基本金属上形成孔洞",
                    "group": 1
                },
                {
                    "id": "焊接电流过大",
                    "label": "焊接电流过大",
                    "name": "焊接电流过大",
                    "group": 5
                },
                {
                    "id": "焊接装配间隙太大",
                    "label": "焊接装配间隙太大",
                    "name": "焊接装配间隙太大",
                    "group": 4
                },
                {
                    "id": "焊速太慢，电弧在焊缝处停留时间过长焊机故障",
                    "label": "焊速太慢，电弧在焊缝处停留时间过长焊机故障",
                    "name": "焊速太慢，电弧在焊缝处停留时间过长焊机故障",
                    "group": 7
                },
                {
                    "id": "焊接件变形（没压紧）",
                    "label": "焊接件变形（没压紧）",
                    "name": "焊接件变形（没压紧）",
                    "group": 7
                },
                {
                    "id": "操作不正确造成短路",
                    "label": "操作不正确造成短路",
                    "name": "操作不正确造成短路",
                    "group": 10
                },
                {
                    "id": "裂纹",
                    "label": "裂纹",
                    "name": "裂纹",
                    "group": 1
                },
                {
                    "id": "在过渡区上的裂纹",
                    "label": "在过渡区上的裂纹",
                    "name": "在过渡区上的裂纹",
                    "group": 1
                },
                {
                    "id": "在焊缝上的纵向、横向裂纹",
                    "label": "在焊缝上的纵向、横向裂纹",
                    "name": "在焊缝上的纵向、横向裂纹",
                    "group": 4
                },
                {
                    "id": "从焊缝延伸到基体金属上的裂纹",
                    "label": "从焊缝延伸到基体金属上的裂纹",
                    "name": "从焊缝延伸到基体金属上的裂纹",
                    "group": 2
                },
                {
                    "id": "补焊处的裂纹",
                    "label": "补焊处的裂纹",
                    "name": "补焊处的裂纹",
                    "group": 5
                },
                {
                    "id": "熄弧处弧坑裂纹",
                    "label": "熄弧处弧坑裂纹",
                    "name": "熄弧处弧坑裂纹",
                    "group": 6
                },
                {
                    "id": "按温度及时间不同分热裂纹和冷裂纹",
                    "label": "按温度及时间不同分热裂纹和冷裂纹",
                    "name": "按温度及时间不同分热裂纹和冷裂纹",
                    "group": 7
                },
                {
                    "id": "结构不合理使焊缝过于集中",
                    "label": "结构不合理使焊缝过于集中",
                    "name": "结构不合理使焊缝过于集中",
                    "group": 3
                },
                {
                    "id": "装配件不协调内应力过大",
                    "label": "装配件不协调内应力过大",
                    "name": "装配件不协调内应力过大",
                    "group": 1
                },
                {
                    "id": "焊接顺序不当造成强大的收缩应力焊接收缩应力",
                    "label": "焊接顺序不当造成强大的收缩应力焊接收缩应力",
                    "name": "焊接顺序不当造成强大的收缩应力焊接收缩应力",
                    "group": 6
                },
                {
                    "id": "超过焊缝金属的强度极限",
                    "label": "超过焊缝金属的强度极限",
                    "name": "超过焊缝金属的强度极限",
                    "group": 9
                },
                {
                    "id": "现场温度过低，冷却速度过快",
                    "label": "现场温度过低，冷却速度过快",
                    "name": "现场温度过低，冷却速度过快",
                    "group": 7
                },
                {
                    "id": "定位焊点距离太大",
                    "label": "定位焊点距离太大",
                    "name": "定位焊点距离太大",
                    "group": 7
                },
                {
                    "id": "加热或熄弧过快",
                    "label": "加热或熄弧过快",
                    "name": "加热或熄弧过快",
                    "group": 1
                },
                {
                    "id": "加热或补焊次数过多",
                    "label": "加热或补焊次数过多",
                    "name": "加热或补焊次数过多",
                    "group": 4
                },
                {
                    "id": "焊丝材料不对",
                    "label": "焊丝材料不对",
                    "name": "焊丝材料不对",
                    "group": 4
                },
                {
                    "id": "焊缝向基体过渡太急剧",
                    "label": "焊缝向基体过渡太急剧",
                    "name": "焊缝向基体过渡太急剧",
                    "group": 1
                },
                {
                    "id": "焊前对零件和焊丝进行彻底清理，最大限度地杜绝外部氢气来源",
                    "label": "焊前对零件和焊丝进行彻底清理，最大限度地杜绝外部氢气来源",
                    "name": "焊前对零件和焊丝进行彻底清理，最大限度地杜绝外部氢气来源",
                    "group": 6
                },
                {
                    "id": "尽量减少焊接时的热量输入",
                    "label": "尽量减少焊接时的热量输入",
                    "name": "尽量减少焊接时的热量输入",
                    "group": 4
                },
                {
                    "id": "焊前250℃整体预热焊后置于150℃的烘箱中",
                    "label": "焊前250℃整体预热焊后置于150℃的烘箱中",
                    "name": "焊前250℃整体预热焊后置于150℃的烘箱中",
                    "group": 6
                },
                {
                    "id": "未焊透",
                    "label": "未焊透",
                    "name": "未焊透",
                    "group": 4
                },
                {
                    "id": "熔化金属和基本金属间或焊缝层间有局部的未溶合",
                    "label": "熔化金属和基本金属间或焊缝层间有局部的未溶合",
                    "name": "熔化金属和基本金属间或焊缝层间有局部的未溶合",
                    "group": 6
                },
                {
                    "id": "在丁字接及搭接接头中焊缝金属往基体金属溶透不足而留下空隙",
                    "label": "在丁字接及搭接接头中焊缝金属往基体金属溶透不足而留下空隙",
                    "name": "在丁字接及搭接接头中焊缝金属往基体金属溶透不足而留下空隙",
                    "group": 4
                },
                {
                    "id": "焊接电流太小或焊接速度太快",
                    "label": "焊接电流太小或焊接速度太快",
                    "name": "焊接电流太小或焊接速度太快",
                    "group": 3
                },
                {
                    "id": "焊缝装配间隙过小",
                    "label": "焊缝装配间隙过小",
                    "name": "焊缝装配间隙过小",
                    "group": 6
                },
                {
                    "id": "坡口不正确",
                    "label": "坡口不正确",
                    "name": "坡口不正确",
                    "group": 10
                },
                {
                    "id": "焊丝加入过早过多",
                    "label": "焊丝加入过早过多",
                    "name": "焊丝加入过早过多",
                    "group": 8
                },
                {
                    "id": "定位焊点过大过密",
                    "label": "定位焊点过大过密",
                    "name": "定位焊点过大过密",
                    "group": 9
                },
                {
                    "id": "焊件清理不彻底有油污",
                    "label": "焊件清理不彻底有油污",
                    "name": "焊件清理不彻底有油污",
                    "group": 8
                },
                {
                    "id": "自动焊焊偏",
                    "label": "自动焊焊偏",
                    "name": "自动焊焊偏",
                    "group": 2
                },
                {
                    "id": "钨极距溶池距离大",
                    "label": "钨极距溶池距离大",
                    "name": "钨极距溶池距离大",
                    "group": 7
                },
                {
                    "id": "改变前后连接环的接缝形式和热源输入位置",
                    "label": "改变前后连接环的接缝形式和热源输入位置",
                    "name": "改变前后连接环的接缝形式和热源输入位置",
                    "group": 5
                },
                {
                    "id": "采用电阻滚焊或连续点焊",
                    "label": "采用电阻滚焊或连续点焊",
                    "name": "采用电阻滚焊或连续点焊",
                    "group": 1
                },
                {
                    "id": "采用真空电子束焊",
                    "label": "采用真空电子束焊",
                    "name": "采用真空电子束焊",
                    "group": 2
                },
                {
                    "id": "咬边",
                    "label": "咬边",
                    "name": "咬边",
                    "group": 7
                },
                {
                    "id": "在焊缝边缘与基体金属交界处形成凹陷",
                    "label": "在焊缝边缘与基体金属交界处形成凹陷",
                    "name": "在焊缝边缘与基体金属交界处形成凹陷",
                    "group": 7
                },
                {
                    "id": "焊接电弧电压过大",
                    "label": "焊接电弧电压过大",
                    "name": "焊接电弧电压过大",
                    "group": 2
                },
                {
                    "id": "焊接速度太快",
                    "label": "焊接速度太快",
                    "name": "焊接速度太快",
                    "group": 6
                },
                {
                    "id": "焊接顺序不对",
                    "label": "焊接顺序不对",
                    "name": "焊接顺序不对",
                    "group": 4
                },
                {
                    "id": "焊件放置的位置不对",
                    "label": "焊件放置的位置不对",
                    "name": "焊件放置的位置不对",
                    "group": 8
                },
                {
                    "id": "操作方法不正确",
                    "label": "操作方法不正确",
                    "name": "操作方法不正确",
                    "group": 7
                },
                {
                    "id": "选择正确的焊接电流和焊接速度",
                    "label": "选择正确的焊接电流和焊接速度",
                    "name": "选择正确的焊接电流和焊接速度",
                    "group": 2
                },
                {
                    "id": "电弧不要太长",
                    "label": "电弧不要太长",
                    "name": "电弧不要太长",
                    "group": 10
                },
                {
                    "id": "提高操作水平",
                    "label": "提高操作水平",
                    "name": "提高操作水平",
                    "group": 5
                },
                {
                    "id": "弧坑",
                    "label": "弧坑",
                    "name": "弧坑",
                    "group": 9
                },
                {
                    "id": "在焊缝熄弧处留下一个凹坑",
                    "label": "在焊缝熄弧处留下一个凹坑",
                    "name": "在焊缝熄弧处留下一个凹坑",
                    "group": 10
                },
                {
                    "id": "操作不当，收弧太快，熄弧时间短",
                    "label": "操作不当，收弧太快，熄弧时间短",
                    "name": "操作不当，收弧太快，熄弧时间短",
                    "group": 6
                },
                {
                    "id": "收弧时焊丝填不足",
                    "label": "收弧时焊丝填不足",
                    "name": "收弧时焊丝填不足",
                    "group": 5
                },
                {
                    "id": "薄件焊接时电流过大",
                    "label": "薄件焊接时电流过大",
                    "name": "薄件焊接时电流过大",
                    "group": 7
                },
                {
                    "id": "焊接电流不要过大",
                    "label": "焊接电流不要过大",
                    "name": "焊接电流不要过大",
                    "group": 5
                },
                {
                    "id": "正确使用熄弧时的衰减电流",
                    "label": "正确使用熄弧时的衰减电流",
                    "name": "正确使用熄弧时的衰减电流",
                    "group": 6
                }, {
                    "id": "凹陷",
                    "label": "凹陷",
                    "name": "凹陷",
                    "group": 2
                },
                {
                    "id": "焊接高度低于基体金属",
                    "label": "焊接高度低于基体金属",
                    "name": "焊接高度低于基体金属",
                    "group": 8
                },
                {
                    "id": "焊接电流大或焊机故障",
                    "label": "焊接电流大或焊机故障",
                    "name": "焊接电流大或焊机故障",
                    "group": 7
                },
                {
                    "id": "加入焊丝不及时",
                    "label": "加入焊丝不及时",
                    "name": "加入焊丝不及时",
                    "group": 7
                },
                {
                    "id": "焊件与整板间有间隙",
                    "label": "焊件与整板间有间隙",
                    "name": "焊件与整板间有间隙",
                    "group": 3
                },
                {
                    "id": "对缝间隙大或焊丝直径小",
                    "label": "对缝间隙大或焊丝直径小",
                    "name": "对缝间隙大或焊丝直径小",
                    "group": 7
                },
                {
                    "id": "零件的尺寸偏差",
                    "label": "零件的尺寸偏差",
                    "name": "零件的尺寸偏差",
                    "group": 8
                },
                {
                    "id": "焊前装配不当及焊接变形",
                    "label": "焊前装配不当及焊接变形",
                    "name": "焊前装配不当及焊接变形",
                    "group": 7
                },
                {
                    "id": "材料厚度偏差",
                    "label": "材料厚度偏差",
                    "name": "材料厚度偏差",
                    "group": 5
                },
                {
                    "id": "焊缝两侧工件刚性不同",
                    "label": "焊缝两侧工件刚性不同",
                    "name": "焊缝两侧工件刚性不同",
                    "group": 10
                },
                {
                    "id": "提高零件焊前的尺寸精度并进行选配",
                    "label": "提高零件焊前的尺寸精度并进行选配",
                    "name": "提高零件焊前的尺寸精度并进行选配",
                    "group": 5
                },
                {
                    "id": "定位焊后检验把关",
                    "label": "定位焊后检验把关",
                    "name": "定位焊后检验把关",
                    "group": 2
                },
                {
                    "id": "错边量合格后再进行缝焊",
                    "label": "错边量合格后再进行缝焊",
                    "name": "错边量合格后再进行缝焊",
                    "group": 1
                },
                {
                    "id": "工件",
                    "label": "工件",
                    "name": "工件",
                    "group": 5
                },
                {
                    "id": "毛坯尺寸检测",
                    "label": "毛坯尺寸检测",
                    "name": "毛坯尺寸检测",
                    "group": 8
                },
                {
                    "id": "理化性能检测",
                    "label": "理化性能检测",
                    "name": "理化性能检测",
                    "group": 4
                },
                {
                    "id": "产品型号",
                    "label": "产品型号",
                    "name": "产品型号",
                    "group": 9
                },
                {
                    "id": "加工图号",
                    "label": "加工图号",
                    "name": "加工图号",
                    "group": 5
                },
                {
                    "id": "炉号",
                    "label": "炉号",
                    "name": "炉号",
                    "group": 7
                },
                {
                    "id": "编号",
                    "label": "编号",
                    "name": "编号",
                    "group": 10
                },
                {
                    "id": "材料牌号",
                    "label": "材料牌号",
                    "name": "材料牌号",
                    "group": 3
                },
                {
                    "id": "设备型号",
                    "label": "设备型号",
                    "name": "设备型号",
                    "group": 2
                },
                {
                    "id": "加工日期",
                    "label": "加工日期",
                    "name": "加工日期",
                    "group": 4
                },
                {
                    "id": "尺寸检测项",
                    "label": "尺寸检测项",
                    "name": "尺寸检测项",
                    "group": 6
                },
                {
                    "id": "厚度",
                    "label": "厚度",
                    "name": "厚度",
                    "group": 7
                },
                {
                    "id": "内径",
                    "label": "内径",
                    "name": "内径",
                    "group": 4
                },
                {
                    "id": "长度",
                    "label": "长度",
                    "name": "长度",
                    "group": 8
                },
                {
                    "id": "角度",
                    "label": "角度",
                    "name": "角度",
                    "group": 1
                },
                {
                    "id": "半径",
                    "label": "半径",
                    "name": "半径",
                    "group": 4
                },
                {
                    "id": "实际尺寸",
                    "label": "实际尺寸",
                    "name": "实际尺寸",
                    "group": 6
                },
                {
                    "id": "理化检测项",
                    "label": "理化检测项",
                    "name": "理化检测项",
                    "group": 7
                },
                {
                    "id": "力学性能",
                    "label": "力学性能",
                    "name": "力学性能",
                    "group": 6
                },
                {
                    "id": "化学成分",
                    "label": "化学成分",
                    "name": "化学成分",
                    "group": 6
                },
                {
                    "id": "金相组织",
                    "label": "金相组织",
                    "name": "金相组织",
                    "group": 4
                },
                {
                    "id": "延伸率",
                    "label": "延伸率",
                    "name": "延伸率",
                    "group": 5
                },
                {
                    "id": "抗拉强度",
                    "label": "抗拉强度",
                    "name": "抗拉强度",
                    "group": 3
                },
                {
                    "id": "屈服强度",
                    "label": "屈服强度",
                    "name": "屈服强度",
                    "group": 10
                },
                {
                    "id": "残余应力",
                    "label": "残余应力",
                    "name": "残余应力",
                    "group": 2
                },
                {
                    "id": "实际性能",
                    "label": "实际性能",
                    "name": "实际性能",
                    "group": 5
                },
                {
                    "id": "标准尺寸",
                    "label": "标准尺寸",
                    "name": "标准尺寸",
                    "group": 2
                },
                {
                    "id": "匹配信息",
                    "label": "匹配信息",
                    "name": "匹配信息",
                    "group": 9
                },
                {
                    "id": "标准性能",
                    "label": "标准性能",
                    "name": "标准性能",
                    "group": 9
                },
                {
                    "id": "匹配合格",
                    "label": "匹配合格",
                    "name": "匹配合格",
                    "group": 7
                },
                {
                    "id": "匹配超差",
                    "label": "匹配超差",
                    "name": "匹配超差",
                    "group": 5
                },
                {
                    "id": "超差件停止加工",
                    "label": "超差件停止加工",
                    "name": "超差件停止加工",
                    "group": 3
                },
                {
                    "id": "机床状态",
                    "label": "机床状态",
                    "name": "机床状态",
                    "group": 10
                },
                {
                    "id": "工装状态",
                    "label": "工装状态",
                    "name": "工装状态",
                    "group": 6
                },
                {
                    "id": "润滑状态",
                    "label": "润滑状态",
                    "name": "润滑状态",
                    "group": 2
                },
                {
                    "id": "工艺参数",
                    "label": "工艺参数",
                    "name": "工艺参数",
                    "group": 3
                },
                {
                    "id": "最大推力",
                    "label": "最大推力",
                    "name": "最大推力",
                    "group": 7
                },
                {
                    "id": "旋轮径向力",
                    "label": "旋轮径向力",
                    "name": "旋轮径向力",
                    "group": 6
                },
                {
                    "id": "机床轴向力",
                    "label": "机床轴向力",
                    "name": "机床轴向力",
                    "group": 2
                },
                {
                    "id": "机床功率",
                    "label": "机床功率",
                    "name": "机床功率",
                    "group": 7
                },
                {
                    "id": "主轴扭矩",
                    "label": "主轴扭矩",
                    "name": "主轴扭矩",
                    "group": 1
                },
                {
                    "id": "设备震动",
                    "label": "设备震动",
                    "name": "设备震动",
                    "group": 8
                },
                {
                    "id": "芯模跳动",
                    "label": "芯模跳动",
                    "name": "芯模跳动",
                    "group": 10
                },
                {
                    "id": "旋轮工作角",
                    "label": "旋轮工作角",
                    "name": "旋轮工作角",
                    "group": 4
                },
                {
                    "id": "工作圆弧",
                    "label": "工作圆弧",
                    "name": "工作圆弧",
                    "group": 5
                },
                {
                    "id": "安装进度",
                    "label": "安装进度",
                    "name": "安装进度",
                    "group": 4
                },
                {
                    "id": "润滑液流量",
                    "label": "润滑液流量",
                    "name": "润滑液流量",
                    "group": 3
                },
                {
                    "id": "润滑液种类",
                    "label": "润滑液种类",
                    "name": "润滑液种类",
                    "group": 3
                },
                {
                    "id": "润滑液温度",
                    "label": "润滑液温度",
                    "name": "润滑液温度",
                    "group": 5
                },
                {
                    "id": "旋压轮下量",
                    "label": "旋压轮下量",
                    "name": "旋压轮下量",
                    "group": 3
                },
                {
                    "id": "进给比",
                    "label": "进给比",
                    "name": "进给比",
                    "group": 5
                },
                {
                    "id": "转速",
                    "label": "转速",
                    "name": "转速",
                    "group": 6
                },
                {
                    "id": "旋轮错距",
                    "label": "旋轮错距",
                    "name": "旋轮错距",
                    "group": 10
                },
                {
                    "id": "旋压成形质量检测",
                    "label": "旋压成形质量检测",
                    "name": "旋压成形质量检测",
                    "group": 8
                },
                {
                    "id": "尺寸检验项",
                    "label": "尺寸检验项",
                    "name": "尺寸检验项",
                    "group": 8
                },
                {
                    "id": "金属探伤",
                    "label": "金属探伤",
                    "name": "金属探伤",
                    "group": 4
                },
                {
                    "id": "跳动",
                    "label": "跳动",
                    "name": "跳动",
                    "group": 2
                },
                {
                    "id": "圆度",
                    "label": "圆度",
                    "name": "圆度",
                    "group": 3
                },
                {
                    "id": "金属表面质量检测",
                    "label": "金属表面质量检测",
                    "name": "金属表面质量检测",
                    "group": 7
                },
                {
                    "id": "金属内部组织检测",
                    "label": "金属内部组织检测",
                    "name": "金属内部组织检测",
                    "group": 9
                },
                {
                    "id": "判定信息",
                    "label": "判定信息",
                    "name": "判定信息",
                    "group": 1
                },
                {
                    "id": "金属探伤标准",
                    "label": "金属探伤标准",
                    "name": "金属探伤标准",
                    "group": 7
                },
                {
                    "id": "判定合格",
                    "label": "判定合格",
                    "name": "判定合格",
                    "group": 7
                },
                {
                    "id": "判定不合格",
                    "label": "判定不合格",
                    "name": "判定不合格",
                    "group": 8
                },
                {
                    "id": "流出",
                    "label": "流出",
                    "name": "流出",
                    "group": 3
                },
                {
                    "id": "质量问题知识库",
                    "label": "质量问题知识库",
                    "name": "质量问题知识库",
                    "group": 2
                },
                {
                    "id": "建议整改项",
                    "label": "建议整改项",
                    "name": "建议整改项",
                    "group": 2
                },
                {
                    "id": "效果验证",
                    "label": "效果验证",
                    "name": "效果验证",
                    "group": 1
                },
                {
                    "id": "达到效果",
                    "label": "达到效果",
                    "name": "达到效果",
                    "group": 1
                },
                {
                    "id": "未达效果",
                    "label": "未达效果",
                    "name": "未达效果",
                    "group": 8
                },
                {
                    "id": "缺陷",
                    "label": "缺陷",
                    "name": "缺陷",
                    "group": 10
                },
                {
                    "id": "超差",
                    "label": "超差",
                    "name": "超差",
                    "group": 10
                },
                {
                    "id": "波纹状剥离",
                    "label": "波纹状剥离",
                    "name": "波纹状剥离",
                    "group": 5
                },
                {
                    "id": "局部变形",
                    "label": "局部变形",
                    "name": "局部变形",
                    "group": 2
                },
                {
                    "id": "旋轮压缩",
                    "label": "旋轮压缩",
                    "name": "旋轮压缩",
                    "group": 5
                },
                {
                    "id": "鳞状剥离",
                    "label": "鳞状剥离",
                    "name": "鳞状剥离",
                    "group": 9
                },
                {
                    "id": "皱折",
                    "label": "皱折",
                    "name": "皱折",
                    "group": 8
                },
                {
                    "id": "内部龟裂",
                    "label": "内部龟裂",
                    "name": "内部龟裂",
                    "group": 5
                },
                {
                    "id": "破裂",
                    "label": "破裂",
                    "name": "破裂",
                    "group": 2
                },
                {
                    "id": "旋转状皱折",
                    "label": "旋转状皱折",
                    "name": "旋转状皱折",
                    "group": 1
                },
                {
                    "id": "壁部皱折",
                    "label": "壁部皱折",
                    "name": "壁部皱折",
                    "group": 8
                },
                {
                    "id": "端部皱折",
                    "label": "端部皱折",
                    "name": "端部皱折",
                    "group": 2
                },
                {
                    "id": "首次进给比比例过大",
                    "label": "首次进给比比例过大",
                    "name": "首次进给比比例过大",
                    "group": 9
                },
                {
                    "id": "轴向破裂",
                    "label": "轴向破裂",
                    "name": "轴向破裂",
                    "group": 5
                },
                {
                    "id": "周向破裂",
                    "label": "周向破裂",
                    "name": "周向破裂",
                    "group": 5
                },
                {
                    "id": "人字形裂纹",
                    "label": "人字形裂纹",
                    "name": "人字形裂纹",
                    "group": 4
                },
                {
                    "id": "端部裂纹",
                    "label": "端部裂纹",
                    "name": "端部裂纹",
                    "group": 2
                },
                {
                    "id": "壁厚减薄率过大",
                    "label": "壁厚减薄率过大",
                    "name": "壁厚减薄率过大",
                    "group": 5
                },
                {
                    "id": "硬化度大",
                    "label": "硬化度大",
                    "name": "硬化度大",
                    "group": 5
                },
                {
                    "id": "进给比过大",
                    "label": "进给比过大",
                    "name": "进给比过大",
                    "group": 9
                },
                {
                    "id": "旋轮成型角过大",
                    "label": "旋轮成型角过大",
                    "name": "旋轮成型角过大",
                    "group": 8
                },
                {
                    "id": "管胚端部有伤痕",
                    "label": "管胚端部有伤痕",
                    "name": "管胚端部有伤痕",
                    "group": 6
                },
                {
                    "id": "形状精度超差",
                    "label": "形状精度超差",
                    "name": "形状精度超差",
                    "group": 2
                },
                {
                    "id": "尺寸精度超差",
                    "label": "尺寸精度超差",
                    "name": "尺寸精度超差",
                    "group": 7
                },
                {
                    "id": "毛胚尺寸检测",
                    "label": "毛胚尺寸检测",
                    "name": "毛胚尺寸检测",
                    "group": 10
                },
                {
                    "id": "旋压质量预测模型",
                    "label": "旋压质量预测模型",
                    "name": "旋压质量预测模型",
                    "group": 9
                },
                {
                    "id": "质量经验知识库",
                    "label": "质量经验知识库",
                    "name": "质量经验知识库",
                    "group": 8
                },
                {
                    "id": "旋压件成形质量检测",
                    "label": "旋压件成形质量检测",
                    "name": "旋压件成形质量检测",
                    "group": 9
                },
                {
                    "id": "预估质量问题分布",
                    "label": "预估质量问题分布",
                    "name": "预估质量问题分布",
                    "group": 7
                },
                {
                    "id": "工件信息",
                    "label": "工件信息",
                    "name": "工件信息",
                    "group": 2
                },
                {
                    "id": "热处理工艺图号",
                    "label": "热处理工艺图号",
                    "name": "热处理工艺图号",
                    "group": 4
                },
                {
                    "id": "产品批次",
                    "label": "产品批次",
                    "name": "产品批次",
                    "group": 7
                },
                {
                    "id": "牌号",
                    "label": "牌号",
                    "name": "牌号",
                    "group": 1
                },
                {
                    "id": "热处理加工炉号",
                    "label": "热处理加工炉号",
                    "name": "热处理加工炉号",
                    "group": 4
                },
                {
                    "id": "热处理设备编号",
                    "label": "热处理设备编号",
                    "name": "热处理设备编号",
                    "group": 6
                },
                {
                    "id": "直线度",
                    "label": "直线度",
                    "name": "直线度",
                    "group": 6
                },
                {
                    "id": "关联分析模型",
                    "label": "关联分析模型",
                    "name": "关联分析模型",
                    "group": 9
                },
                {
                    "id": "热处理信息",
                    "label": "热处理信息",
                    "name": "热处理信息",
                    "group": 1
                },
                {
                    "id": "力学性能关键影响因素",
                    "label": "力学性能关键影响因素",
                    "name": "力学性能关键影响因素",
                    "group": 1
                },
                {
                    "id": "生产参数相关性",
                    "label": "生产参数相关性",
                    "name": "生产参数相关性",
                    "group": 7
                },
                {
                    "id": "装炉信息",
                    "label": "装炉信息",
                    "name": "装炉信息",
                    "group": 9
                },
                {
                    "id": "气体流量检测信息",
                    "label": "气体流量检测信息",
                    "name": "气体流量检测信息",
                    "group": 7
                },
                {
                    "id": "整形生产参数",
                    "label": "整形生产参数",
                    "name": "整形生产参数",
                    "group": 5
                },
                {
                    "id": "数量",
                    "label": "数量",
                    "name": "数量",
                    "group": 2
                },
                {
                    "id": "装炉间隙",
                    "label": "装炉间隙",
                    "name": "装炉间隙",
                    "group": 9
                },
                {
                    "id": "垂直度",
                    "label": "垂直度",
                    "name": "垂直度",
                    "group": 7
                },
                {
                    "id": "速度",
                    "label": "速度",
                    "name": "速度",
                    "group": 6
                },
                {
                    "id": "方向",
                    "label": "方向",
                    "name": "方向",
                    "group": 3
                },
                {
                    "id": "下压量",
                    "label": "下压量",
                    "name": "下压量",
                    "group": 2
                },
                {
                    "id": "回弹量",
                    "label": "回弹量",
                    "name": "回弹量",
                    "group": 2
                },
                {
                    "id": "热处理",
                    "label": "热处理",
                    "name": "热处理",
                    "group": 2
                },
                {
                    "id": "质量信息测量",
                    "label": "质量信息测量",
                    "name": "质量信息测量",
                    "group": 7
                },
                {
                    "id": "热处理后圆度",
                    "label": "热处理后圆度",
                    "name": "热处理后圆度",
                    "group": 5
                },
                {
                    "id": "热处理后长度",
                    "label": "热处理后长度",
                    "name": "热处理后长度",
                    "group": 4
                },
                {
                    "id": "热处理后直线度",
                    "label": "热处理后直线度",
                    "name": "热处理后直线度",
                    "group": 2
                },
                {
                    "id": "热处理后力学性能",
                    "label": "热处理后力学性能",
                    "name": "热处理后力学性能",
                    "group": 10
                },
                {
                    "id": "断后伸长率",
                    "label": "断后伸长率",
                    "name": "断后伸长率",
                    "group": 10
                },
                {
                    "id": "热处理后实际尺寸",
                    "label": "热处理后实际尺寸",
                    "name": "热处理后实际尺寸",
                    "group": 8
                },
                {
                    "id": "热处理后标准尺寸",
                    "label": "热处理后标准尺寸",
                    "name": "热处理后标准尺寸",
                    "group": 1
                },
                {
                    "id": "判定热处理信息",
                    "label": "判定热处理信息",
                    "name": "判定热处理信息",
                    "group": 4
                },
                {
                    "id": "判定热处理合格",
                    "label": "判定热处理合格",
                    "name": "判定热处理合格",
                    "group": 7
                },
                {
                    "id": "判定热处理不合格",
                    "label": "判定热处理不合格",
                    "name": "判定热处理不合格",
                    "group": 8
                },
                {
                    "id": "壳体整形",
                    "label": "壳体整形",
                    "name": "壳体整形",
                    "group": 1
                },
                {
                    "id": "重新判定",
                    "label": "重新判定",
                    "name": "重新判定",
                    "group": 6
                },
                {
                    "id": "壳体",
                    "label": "壳体",
                    "name": "壳体",
                    "group": 9
                },
                {
                    "id": "壳体信息",
                    "label": "壳体信息",
                    "name": "壳体信息",
                    "group": 1
                },
                {
                    "id": "壳体外形尺寸",
                    "label": "壳体外形尺寸",
                    "name": "壳体外形尺寸",
                    "group": 4
                },
                {
                    "id": "壳体标准模型",
                    "label": "壳体标准模型",
                    "name": "壳体标准模型",
                    "group": 8
                },
                {
                    "id": "外挂件",
                    "label": "外挂件",
                    "name": "外挂件",
                    "group": 6
                },
                {
                    "id": "吊挂",
                    "label": "吊挂",
                    "name": "吊挂",
                    "group": 1
                },
                {
                    "id": "弹簧支座",
                    "label": "弹簧支座",
                    "name": "弹簧支座",
                    "group": 10
                },
                {
                    "id": "旋牙筒体段",
                    "label": "旋牙筒体段",
                    "name": "旋牙筒体段",
                    "group": 7
                },
                {
                    "id": "前封头",
                    "label": "前封头",
                    "name": "前封头",
                    "group": 7
                },
                {
                    "id": "后封头",
                    "label": "后封头",
                    "name": "后封头",
                    "group": 10
                },
                {
                    "id": "匹配拟合",
                    "label": "匹配拟合",
                    "name": "匹配拟合",
                    "group": 7
                },
                {
                    "id": "不匹配",
                    "label": "不匹配",
                    "name": "不匹配",
                    "group": 5
                },
                {
                    "id": "匹配",
                    "label": "匹配",
                    "name": "匹配",
                    "group": 6
                },
                {
                    "id": "流出待工艺师处理",
                    "label": "流出待工艺师处理",
                    "name": "流出待工艺师处理",
                    "group": 3
                },
                {
                    "id": "机外预调输入",
                    "label": "机外预调输入",
                    "name": "机外预调输入",
                    "group": 4
                },
                {
                    "id": "机外预调",
                    "label": "机外预调",
                    "name": "机外预调",
                    "group": 4
                },
                {
                    "id": "输出",
                    "label": "输出",
                    "name": "输出",
                    "group": 1
                },
                {
                    "id": "校调G代码",
                    "label": "校调G代码",
                    "name": "校调G代码",
                    "group": 9
                },
                {
                    "id": "壳体三维点云数据",
                    "label": "壳体三维点云数据",
                    "name": "壳体三维点云数据",
                    "group": 3
                },
                {
                    "id": "机外预调数据库",
                    "label": "机外预调数据库",
                    "name": "机外预调数据库",
                    "group": 9
                },
                {
                    "id": "加工中心校调",
                    "label": "加工中心校调",
                    "name": "加工中心校调",
                    "group": 5
                },
                {
                    "id": "是否试切",
                    "label": "是否试切",
                    "name": "是否试切",
                    "group": 2
                },
                {
                    "id": "试切",
                    "label": "试切",
                    "name": "试切",
                    "group": 8
                },
                {
                    "id": "不试切",
                    "label": "不试切",
                    "name": "不试切",
                    "group": 10
                },
                {
                    "id": "燃烧室壳体加工",
                    "label": "燃烧室壳体加工",
                    "name": "燃烧室壳体加工",
                    "group": 2
                },
                {
                    "id": "迭代优化",
                    "label": "迭代优化",
                    "name": "迭代优化",
                    "group": 6
                },
                {
                    "id": "壳体在机床上信息",
                    "label": "壳体在机床上信息",
                    "name": "壳体在机床上信息",
                    "group": 6
                },
                {
                    "id": "母线最高点距吊挂距离",
                    "label": "母线最高点距吊挂距离",
                    "name": "母线最高点距吊挂距离",
                    "group": 10
                },
                {
                    "id": "母线最高点距弹簧距离",
                    "label": "母线最高点距弹簧距离",
                    "name": "母线最高点距弹簧距离",
                    "group": 3
                },
                {
                    "id": "吊挂距中心距离",
                    "label": "吊挂距中心距离",
                    "name": "吊挂距中心距离",
                    "group": 9
                },
                {
                    "id": "端面跳动",
                    "label": "端面跳动",
                    "name": "端面跳动",
                    "group": 4
                },
                {
                    "id": "基本信息",
                    "label": "基本信息",
                    "name": "基本信息",
                    "group": 10
                },
                {
                    "id": "工艺信息",
                    "label": "工艺信息",
                    "name": "工艺信息",
                    "group": 1
                },
                {
                    "id": "产品图号",
                    "label": "产品图号",
                    "name": "产品图号",
                    "group": 1
                },
                {
                    "id": "产品编号",
                    "label": "产品编号",
                    "name": "产品编号",
                    "group": 5
                },
                {
                    "id": "工序号",
                    "label": "工序号",
                    "name": "工序号",
                    "group": 10
                },
                {
                    "id": "加工方法",
                    "label": "加工方法",
                    "name": "加工方法",
                    "group": 8
                },
                {
                    "id": "检测方法",
                    "label": "检测方法",
                    "name": "检测方法",
                    "group": 6
                },
                {
                    "id": "判定要求",
                    "label": "判定要求",
                    "name": "判定要求",
                    "group": 2
                },
                {
                    "id": "图像采集",
                    "label": "图像采集",
                    "name": "图像采集",
                    "group": 6
                },
                {
                    "id": "编码格式",
                    "label": "编码格式",
                    "name": "编码格式",
                    "group": 3
                },
                {
                    "id": "图像编号",
                    "label": "图像编号",
                    "name": "图像编号",
                    "group": 3
                },
                {
                    "id": "存储位置",
                    "label": "存储位置",
                    "name": "存储位置",
                    "group": 10
                },
                {
                    "id": "采集方式",
                    "label": "采集方式",
                    "name": "采集方式",
                    "group": 1
                },
                {
                    "id": "底片扫描",
                    "label": "底片扫描",
                    "name": "底片扫描",
                    "group": 1
                },
                {
                    "id": "数字成像",
                    "label": "数字成像",
                    "name": "数字成像",
                    "group": 9
                },
                {
                    "id": "图像缺陷采集",
                    "label": "图像缺陷采集",
                    "name": "图像缺陷采集",
                    "group": 6
                },
                {
                    "id": "缺陷信息",
                    "label": "缺陷信息",
                    "name": "缺陷信息",
                    "group": 1
                },
                {
                    "id": "缺陷图像",
                    "label": "缺陷图像",
                    "name": "缺陷图像",
                    "group": 5
                },
                {
                    "id": "缺陷位置",
                    "label": "缺陷位置",
                    "name": "缺陷位置",
                    "group": 10
                },
                {
                    "id": "缺陷数量",
                    "label": "缺陷数量",
                    "name": "缺陷数量",
                    "group": 5
                },
                {
                    "id": "缺陷性质",
                    "label": "缺陷性质",
                    "name": "缺陷性质",
                    "group": 10
                },
                {
                    "id": "缺陷尺寸",
                    "label": "缺陷尺寸",
                    "name": "缺陷尺寸",
                    "group": 7
                },
                {
                    "id": "判定结果",
                    "label": "判定结果",
                    "name": "判定结果",
                    "group": 6
                },
                {
                    "id": "人工复查",
                    "label": "人工复查",
                    "name": "人工复查",
                    "group": 3
                },
                {
                    "id": "生成报告",
                    "label": "生成报告",
                    "name": "生成报告",
                    "group": 10
                },
                {
                    "id": "样本训练",
                    "label": "样本训练",
                    "name": "样本训练",
                    "group": 8
                },
                {
                    "id": "模型优化迭代",
                    "label": "模型优化迭代",
                    "name": "模型优化迭代",
                    "group": 2
                },
                {
                    "id": "烧穿缺陷图像",
                    "label": "烧穿缺陷图像",
                    "name": "烧穿缺陷图像",
                    "group": 9
                },
                {
                    "id": "气孔缺陷图像",
                    "label": "气孔缺陷图像",
                    "name": "气孔缺陷图像",
                    "group": 5
                },
                {
                    "id": "裂纹缺陷图像",
                    "label": "裂纹缺陷图像",
                    "name": "裂纹缺陷图像",
                    "group": 6
                },
                {
                    "id": "未焊透缺陷图像",
                    "label": "未焊透缺陷图像",
                    "name": "未焊透缺陷图像",
                    "group": 9
                },
                {
                    "id": "咬边缺陷图像",
                    "label": "咬边缺陷图像",
                    "name": "咬边缺陷图像",
                    "group": 7
                },
                {
                    "id": "弧坑缺陷图像",
                    "label": "弧坑缺陷图像",
                    "name": "弧坑缺陷图像",
                    "group": 1
                },
                {
                    "id": "凹陷缺陷图像",
                    "label": "凹陷缺陷图像",
                    "name": "凹陷缺陷图像",
                    "group": 9
                },
                {
                    "id": "错边缺陷图像",
                    "label": "错边缺陷图像",
                    "name": "错边缺陷图像",
                    "group": 6
                }
            ],
            links: [
                {
                    "id": nanoid(),
                    "label": "perform_a_weld",
                    "source": "2021-06-16_10:07:19", "target": "焊接工件1"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "原材料"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "原材料", "target": "高温合金钢GH3628"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件1", "target": "焊缝数量"
                },
                {
                    "id": nanoid(),
                    "label": "perform_a_weld",
                    "source": "焊接工件1", "target": "焊接"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体尺寸信息", "target": "焊缝正面余高"
                },
                {
                    "id": nanoid(),
                    "label": "execute_a_measurement",
                    "source": "2021-06-16_10:07:19", "target": "真空度"
                },
                {
                    "id": nanoid(),
                    "label": "execute_a_measurement",
                    "source": "2021-06-16_10:07:19", "target": "加速电压"
                },
                {
                    "id": nanoid(),
                    "label": "execute_a_measurement",
                    "source": "2021-06-16_10:07:19", "target": "电子束流"
                },
                {
                    "id": nanoid(),
                    "label": "execute_a_measurement",
                    "source": "2021-06-16_10:07:19", "target": "电子聚焦量"
                },
                {
                    "id": nanoid(),
                    "label": "execute_a_measurement",
                    "source": "真空度", "target": "-891"
                },
                {
                    "id": nanoid(),
                    "label": "execute_a_measurement",
                    "source": "加速电压", "target": "130"
                },
                {
                    "id": nanoid(),
                    "label": "execute_a_measurement",
                    "source": "电子束流", "target": "0.165"
                },
                {
                    "id": nanoid(),
                    "label": "execute_a_measurement",
                    "source": "电子聚焦量", "target": "2034"
                },
                {
                    "id": nanoid(),
                    "label": "make_an_image_detection",
                    "source": "2021-06-16_10:22:19", "target": "表面缺陷"
                },
                {
                    "id": nanoid(),
                    "label": "detect_a_feature",
                    "source": "2021-06-16_10:22:19", "target": "气孔"
                },
                {
                    "id": nanoid(),
                    "label": "make_an_image_detection",
                    "source": "焊接图像", "target": "缺陷特征"
                },
                {
                    "id": nanoid(),
                    "label": "detect_a_feature",
                    "source": "焊接图像缺陷检测", "target": "气孔"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空电子束焊机", "target": "真空度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空电子束焊机", "target": "工作距离"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空电子束焊机", "target": "加速电压"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空电子束焊机", "target": "电子束流"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空电子束焊机", "target": "聚焦电流"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空电子束焊机", "target": "焊接速度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空电子束焊机", "target": "激光功率"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空电子束焊机", "target": "离焦量"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空电子束焊机", "target": "激光功率"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "电子枪功率", "target": "15kW"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "电子枪加速电压", "target": "60kW"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "电子束最大束流", "target": "250mA"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空获得时间", "target": "15min"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空室真空度", "target": "0.05Pa"
                },
                {
                    "id": nanoid(),
                    "label": "detect",
                    "source": "焊接工件", "target": "阴极使用寿命模型"
                },
                {
                    "id": nanoid(),
                    "label": "detect",
                    "source": "旋压加工", "target": "旋压成型质量检测"
                },
                {
                    "id": nanoid(),
                    "label": "perform_a_machining",
                    "source": "真空电子束焊机", "target": "焊接工件1"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件1", "target": "产品批次号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件1", "target": "焊接图号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件1", "target": "原材料"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件1", "target": "壳体直径"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件1", "target": "壳体壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件1", "target": "壳体长度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件1", "target": "壳体位置"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件1", "target": "焊缝要求"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "产品批次号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "焊接图号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "原材料"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "壳体直径"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "壳体壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "壳体长度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "焊缝数量"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "壳体位置"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "焊缝要求"
                },
                {
                    "id": nanoid(),
                    "label": "welding",
                    "source": "焊接工件2", "target": "焊接"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接", "target": "质量信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "待焊尺寸信息", "target": "焊缝结构"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "待焊尺寸信息", "target": "待焊部位直径"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "待焊尺寸信息", "target": "待焊部位壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "待焊尺寸信息", "target": "待焊等级要求"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "待焊尺寸信息", "target": "焊接"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "焊接参数", "target": "待焊尺寸信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain_from",
                    "source": "设备信息", "target": "焊接参数"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接参数", "target": "焊接电流"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接参数", "target": "聚焦电流"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接参数", "target": "加速电压"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接参数", "target": "真空度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接参数", "target": "焊接速度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "设备信息", "target": "阴极使用时间"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体尺寸信息", "target": "焊缝背面余高"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体尺寸信息", "target": "焊缝力学性能34"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "壳体尺寸信息", "target": "焊缝质量信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊缝质量信息", "target": "焊缝正面余高"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊缝质量信息", "target": "焊缝背面余高"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊缝质量信息", "target": "焊缝内部质量"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊缝质量信息", "target": "焊缝力学性能"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "焊缝质量信息", "target": "质量信息"
                },
                {
                    "id": nanoid(),
                    "label": "input",
                    "source": "质量信息", "target": "生产优化模型"
                },
                {
                    "id": nanoid(),
                    "label": "output",
                    "source": "生产优化模型", "target": "推荐工艺参数"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "推荐工艺参数", "target": "焊接"
                },
                {
                    "id": nanoid(),
                    "label": "next",
                    "source": "2021-06-16_10:07:19", "target": "2021-06-16_10:22:19"
                },
                {
                    "id": nanoid(),
                    "label": "previous",
                    "source": "2021-06-16_10:22:19", "target": "2021-06-16_10:07:19"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:07:19", "target": "焊接工件1"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:07:19", "target": "真空电子束焊机"
                },
                {
                    "id": nanoid(),
                    "label": "perform_a_machining",
                    "source": "真空电子束焊机", "target": "焊接工件1"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体直径"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体尾跳"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体中跳"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "旋压转速"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "旋压进给比"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "旋压圆弧半径"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体小端壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体小端内径"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体锥段壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体筒身壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体大端内径"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体大端壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体总长"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "壳体错距"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "旋压工作角"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "高温合金钢GH4009"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件1", "target": "壳体总长"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "旋压工作角"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:22:19", "target": "焊接工件2"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:22:19", "target": "真空电子束焊机"
                },
                {
                    "id": nanoid(),
                    "label": "perform_a_machining",
                    "source": "真空电子束焊机", "target": "焊接工件2"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "原材料"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "壳体直径"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "壳体壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "壳体尾跳"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "壳体中跳"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "旋压转速"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "旋压进给比"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "旋压圆弧半径"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "壳体小端壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "壳体小端内径"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "壳体锥段壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "壳体筒身壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "壳体大端内径"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "壳体大端壁厚"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "壳体总长"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "旋压工作角"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "高温合金钢GH3628"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "原材料", "target": "高温合金钢GH3628"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "壳体小端壁厚", "target": "5.05mm"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "壳体小端内径", "target": "39.42mm"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "壳体锥段壁厚", "target": "2.49mm"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "壳体筒身壁厚", "target": "2.48mm"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "壳体大端内径", "target": "69.86mm"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "壳体大端壁厚", "target": "0.6mm"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "壳体总长", "target": "352mm"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "旋压工作角", "target": "26"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "旋压圆弧半径", "target": "4mm"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "旋压进给比", "target": "0.26"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体错距", "target": "2.4mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "旋压转速", "target": "260"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体中跳", "target": "0.24mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体尾跳", "target": "0.16mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "0.16mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "0.24mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "260"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "2.4mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "0.26"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "4mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "26"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "352mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "0.6mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "69.86mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "2.48mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "2.49mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "39.42mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接工件2", "target": "5.05mm"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "GAK12-发动机壳体", "target": "焊接工件1"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "正背面余高"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "表面缺陷"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "内部质量"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "拉伸强度"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "焊接变形"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "真空度"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "加速电压"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "电子束流"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件2", "target": "电子聚焦量"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:07:19", "target": "真空度"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:07:19", "target": "加速电压"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:07:19", "target": "电子束流"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:07:19", "target": "电子聚焦量"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "真空度"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "加速电压"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "电子束流"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "焊接工件1", "target": "电子聚焦量"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "真空度", "target": "-890"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "加速电压", "target": "130"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "电子束流", "target": "0.167"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "电子聚焦量", "target": "2034"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:07:19", "target": "表面缺陷"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:07:19", "target": "错边"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "表面缺陷", "target": "错边"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:22:19", "target": "焊接工件2"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:22:19", "target": "拉伸强度"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:22:19", "target": "焊接变形"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "拉伸强度", "target": "9MPa"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "焊接变形", "target": "1mm"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:22:19", "target": "9MPa"
                },
                {
                    "id": nanoid(),
                    "label": "has",
                    "source": "2021-06-16_10:22:19", "target": "1mm"
                },
                {
                    "id": nanoid(),
                    "label": "焊缝表面及焊缝内部形成圆形椭圆形或带状的及不规则的孔洞",
                    "source": "气孔", "target": "has_feature"
                },
                {
                    "id": nanoid(),
                    "label": "环境湿度大",
                    "source": "气孔", "target": "make_a_cause"
                },
                {
                    "id": nanoid(),
                    "label": "焊前对零件和焊丝进行真空除氢热处理",
                    "source": "气孔", "target": "give_a_measure"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "气孔", "target": "保护气体中有水份或碳氧化合物"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "气孔", "target": "焊接不稳定"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "气孔", "target": "气体保护不良"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "气孔", "target": "焊丝焊件清理不干净有油污"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "气孔", "target": "焊接速度过高使得气不易逸出"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "气孔", "target": "焊接冷却快使得气不易逸出"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "气孔", "target": "氩气流量过小或喷嘴直径不合适"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "气孔", "target": "焊接材料不致密"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "气孔", "target": "焊丝有夹渣"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "气孔", "target": "渣焊接垫板潮湿"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "气孔", "target": "用高速钢丝轮打磨零件焊接区内外表面及接缝端面"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "气孔", "target": "把零件内外表面用丙酮或无水酒精彻底清洗干净"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "烧穿", "target": "基本金属上形成孔洞"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "烧穿", "target": "焊接电流过大"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "烧穿", "target": "焊接装配间隙太大"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "烧穿", "target": "焊速太慢，电弧在焊缝处停留时间过长焊机故障"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "烧穿", "target": "焊接件变形（没压紧）"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "烧穿", "target": "操作不正确造成短路"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "在过渡区上的裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "在焊缝上的纵向、横向裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "从焊缝延伸到基体金属上的裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "补焊处的裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "熄弧处弧坑裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "按温度及时间不同分热裂纹和冷裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "裂纹", "target": "结构不合理使焊缝过于集中"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "裂纹", "target": "装配件不协调内应力过大"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "裂纹", "target": "焊接顺序不当造成强大的收缩应力焊接收缩应力"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "裂纹", "target": "超过焊缝金属的强度极限"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "裂纹", "target": "现场温度过低，冷却速度过快"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "裂纹", "target": "定位焊点距离太大"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "在过渡区上的裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "在焊缝上的纵向、横向裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "从焊缝延伸到基体金属上的裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "补焊处的裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "熄弧处弧坑裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹", "target": "按温度及时间不同分热裂纹和冷裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "裂纹", "target": "加热或熄弧过快"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "裂纹", "target": "加热或补焊次数过多"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "裂纹", "target": "焊丝材料不对"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "裂纹", "target": "焊缝向基体过渡太急剧"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "裂纹", "target": "焊前对零件和焊丝进行彻底清理，最大限度地杜绝外部氢气来源"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "裂纹", "target": "尽量减少焊接时的热量输入"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "裂纹", "target": "焊前250℃整体预热焊后置于150℃的烘箱中"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "未焊透", "target": "熔化金属和基本金属间或焊缝层间有局部的未溶合"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "未焊透", "target": "在丁字接及搭接接头中焊缝金属往基体金属溶透不足而留下空隙"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "未焊透", "target": "焊接电流太小或焊接速度太快"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "未焊透", "target": "焊缝装配间隙过小"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "未焊透", "target": "坡口不正确"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "未焊透", "target": "焊丝加入过早过多"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "未焊透", "target": "定位焊点过大过密"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "未焊透", "target": "焊件清理不彻底有油污"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "未焊透", "target": "自动焊焊偏"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "未焊透", "target": "钨极距溶池距离大"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "未焊透", "target": "改变前后连接环的接缝形式和热源输入位置"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "未焊透", "target": "采用电阻滚焊或连续点焊"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "未焊透", "target": "采用真空电子束焊"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "咬边", "target": "在焊缝边缘与基体金属交界处形成凹陷"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "咬边", "target": "焊接电流过大"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "咬边", "target": "焊接电弧电压过大"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "咬边", "target": "焊接速度太快"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "咬边", "target": "焊接顺序不对"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "咬边", "target": "焊件放置的位置不对"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "咬边", "target": "操作方法不正确"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "咬边", "target": "选择正确的焊接电流和焊接速度"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "咬边", "target": "电弧不要太长"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "咬边", "target": "提高操作水平"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "弧坑", "target": "在焊缝熄弧处留下一个凹坑"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "弧坑", "target": "操作不当，收弧太快，熄弧时间短"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "弧坑", "target": "收弧时焊丝填不足"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "弧坑", "target": "薄件焊接时电流过大"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "弧坑", "target": "提高操作水平"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "弧坑", "target": "焊接电流不要过大"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "弧坑", "target": "正确使用熄弧时的衰减电流"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "凹陷", "target": "焊接高度低于基体金属"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "凹陷", "target": "焊接电流大或焊机故障"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "凹陷", "target": "加入焊丝不及时"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "凹陷", "target": "焊件与整板间有间隙"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "凹陷", "target": "对缝间隙大或焊丝直径小"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "错边", "target": "零件的尺寸偏差"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "错边", "target": "焊前装配不当及焊接变形"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "错边", "target": "材料厚度偏差"
                },
                {
                    "id": nanoid(),
                    "label": "cause",
                    "source": "错边", "target": "焊缝两侧工件刚性不同"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "错边", "target": "提高零件焊前的尺寸精度并进行选配"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "错边", "target": "定位焊后检验把关"
                },
                {
                    "id": nanoid(),
                    "label": "measure",
                    "source": "错边", "target": "错边量合格后再进行缝焊"
                },
                {
                    "id": nanoid(),
                    "label": "detect",
                    "source": "工件", "target": "毛坯尺寸检测"
                },
                {
                    "id": nanoid(),
                    "label": "detect",
                    "source": "工件", "target": "理化性能检测"
                },
                {
                    "id": nanoid(),
                    "label": "perform_a_machining",
                    "source": "工件", "target": "旋压加工"
                },
                {
                    "id": nanoid(),
                    "label": "detect",
                    "source": "旋压加工", "target": "旋压成型质量检测"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件", "target": "产品型号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件", "target": "加工图号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件", "target": "炉号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件", "target": "编号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件", "target": "材料牌号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件", "target": "设备型号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件", "target": "加工日期"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "毛坯尺寸检测", "target": "尺寸检测项"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "尺寸检测项", "target": "厚度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "尺寸检测项", "target": "内径"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "尺寸检测项", "target": "长度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "尺寸检测项", "target": "角度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "尺寸检测项", "target": "半径"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "厚度", "target": "实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "内径", "target": "实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "长度", "target": "实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "角度", "target": "实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "半径", "target": "实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "理化性能检测", "target": "理化检测项"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "理化检测项", "target": "力学性能"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "理化检测项", "target": "化学成分"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "理化检测项", "target": "金相组织"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "力学性能", "target": "延伸率"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "力学性能", "target": "抗拉强度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "力学性能", "target": "屈服强度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "力学性能", "target": "残余应力"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "延伸率", "target": "实际性能"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "抗拉强度", "target": "实际性能"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "屈服强度", "target": "实际性能"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "残余应力", "target": "实际性能"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "化学成分", "target": "实际性能"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "金相组织", "target": "实际性能"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "标准尺寸", "target": "匹配信息"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "实际尺寸", "target": "匹配信息"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "标准性能", "target": "匹配信息"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "实际性能", "target": "匹配信息"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "匹配信息", "target": "匹配合格"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "匹配信息", "target": "匹配合格"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "匹配超差", "target": "超差件停止加工"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "旋压加工", "target": "机床状态"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "旋压加工", "target": "工装状态"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "旋压加工", "target": "润滑状态"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "旋压加工", "target": "工艺参数"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "机床状态", "target": "最大推力"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "机床状态", "target": "旋轮径向力"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "机床状态", "target": "机床轴向力"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "机床状态", "target": "机床功率"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "机床状态", "target": "主轴扭矩"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "机床状态", "target": "设备震动"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工装状态", "target": "芯模跳动"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工装状态", "target": "旋轮工作角"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工装状态", "target": "工作圆弧"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工装状态", "target": "安装进度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "润滑状态", "target": "润滑液流量"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "润滑状态", "target": "润滑液种类"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "润滑状态", "target": "润滑液温度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工艺参数", "target": "旋压轮下量"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工艺参数", "target": "进给比"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工艺参数", "target": "转速"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工艺参数", "target": "旋轮错距"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "旋压成形质量检测", "target": "尺寸检验项"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "旋压成形质量检测", "target": "金属探伤"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "尺寸检验项", "target": "厚度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "尺寸检验项", "target": "内径"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "尺寸检验项", "target": "长度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "尺寸检验项", "target": "跳动"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "尺寸检验项", "target": "圆度"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "厚度", "target": "实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "内径", "target": "实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "长度", "target": "实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "跳动", "target": "实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "圆度", "target": "实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "金属探伤", "target": "金属表面质量检测"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "金属探伤", "target": "金属内部组织检测"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "标准尺寸", "target": "判定信息"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "实际尺寸", "target": "判定信息"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "金属探伤标准", "target": "判定信息"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "金属表面质量检测", "target": "判定信息"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "金属内部组织检测", "target": "判定信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "判定信息", "target": "判定合格"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "判定信息", "target": "判定不合格"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "判定合格", "target": "流出"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "判定不合格", "target": "质量问题知识库"
                },
                {
                    "id": nanoid(),
                    "label": "execute",
                    "source": "建议整改项", "target": "效果验证"
                },
                {
                    "id": nanoid(),
                    "label": "output",
                    "source": "效果验证", "target": "达到效果"
                },
                {
                    "id": nanoid(),
                    "label": "output",
                    "source": "效果验证", "target": "未达效果"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "未达效果", "target": "质量问题知识库"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "达到效果", "target": "流出"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "质量问题知识库", "target": "缺陷"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "质量问题知识库", "target": "超差"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷", "target": "波纹状剥离"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷", "target": "局部变形"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷", "target": "旋轮压缩"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷", "target": "鳞状剥离"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷", "target": "皱折"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷", "target": "内部龟裂"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷", "target": "破裂"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "皱折", "target": "旋转状皱折"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "皱折", "target": "壁部皱折"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "皱折", "target": "端部皱折"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "内部龟裂", "target": "首次进给比比例过大"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "破裂", "target": "轴向破裂"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "破裂", "target": "周向破裂"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "破裂", "target": "人字形裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "破裂", "target": "端部裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "轴向破裂", "target": "壁厚减薄率过大"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "轴向破裂", "target": "硬化度大"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "轴向破裂", "target": "进给比过大"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "轴向破裂", "target": "壁厚减薄率过大"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "周向破裂", "target": "旋轮成型角过大"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "周向破裂", "target": "壁厚减薄率过大"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "周向破裂", "target": "进给比过大"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "端部裂纹", "target": "管胚端部有伤痕"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "端部裂纹", "target": "硬化度大"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "超差", "target": "形状精度超差"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "超差", "target": "尺寸精度超差"
                },
                {
                    "id": nanoid(),
                    "label": "input",
                    "source": "毛胚尺寸检测", "target": "旋压质量预测模型"
                },
                {
                    "id": nanoid(),
                    "label": "input",
                    "source": "理化性能检测", "target": "旋压质量预测模型"
                },
                {
                    "id": nanoid(),
                    "label": "input",
                    "source": "旋压加工", "target": "旋压质量预测模型"
                },
                {
                    "id": nanoid(),
                    "label": "input",
                    "source": "理化性能检测", "target": "质量经验知识库"
                },
                {
                    "id": nanoid(),
                    "label": "input",
                    "source": "旋压加工", "target": "质量经验知识库"
                },
                {
                    "id": nanoid(),
                    "label": "input",
                    "source": "旋压件成形质量检测", "target": "质量经验知识库"
                },
                {
                    "id": nanoid(),
                    "label": "driven",
                    "source": "质量经验知识库", "target": "旋压质量预测模型"
                },
                {
                    "id": nanoid(),
                    "label": "output",
                    "source": "旋压质量预测模型", "target": "预估质量问题分布"
                },
                {
                    "id": nanoid(),
                    "label": "output",
                    "source": "旋压质量预测模型", "target": "推荐工艺参数"
                },
                {
                    "id": nanoid(),
                    "label": "input",
                    "source": "推荐工艺参数", "target": "旋压加工"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件", "target": "工件信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件信息", "target": "热处理工艺图号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件信息", "target": "产品批次"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件信息", "target": "牌号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件信息", "target": "热处理加工炉号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件信息", "target": "热处理设备编号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件信息", "target": "壳体尺寸信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体尺寸信息", "target": "圆度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体尺寸信息", "target": "长度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体尺寸信息", "target": "直线度"
                },
                {
                    "id": nanoid(),
                    "label": "driven_by",
                    "source": "关联分析模型", "target": "工件信息"
                },
                {
                    "id": nanoid(),
                    "label": "driven_by",
                    "source": "关联分析模型", "target": "壳体尺寸信息"
                },
                {
                    "id": nanoid(),
                    "label": "driven_by",
                    "source": "关联分析模型", "target": "热处理信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "关联分析模型", "target": "力学性能关键影响因素"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "关联分析模型", "target": "生产参数相关性"
                },
                {
                    "id": nanoid(),
                    "label": "",
                    "source": "热处理信息", "target": "装炉信息"
                },
                {
                    "id": nanoid(),
                    "label": "",
                    "source": "热处理信息", "target": "气体流量检测信息"
                },
                {
                    "id": nanoid(),
                    "label": "",
                    "source": "热处理信息", "target": "整形生产参数"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "装炉信息", "target": "数量"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "装炉信息", "target": "装炉间隙"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "装炉信息", "target": "垂直度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "气体流量检测信息", "target": "速度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "气体流量检测信息", "target": "方向"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "整形生产参数", "target": "下压量"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "整形生产参数", "target": "回弹量"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "热处理", "target": "质量信息测量"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "质量信息测量", "target": "热处理后圆度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "质量信息测量", "target": "热处理后长度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "质量信息测量", "target": "热处理后直线度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "质量信息测量", "target": "热处理后力学性能"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "热处理后力学性能", "target": "抗拉强度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "热处理后力学性能", "target": "屈服强度"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "热处理后力学性能", "target": "断后伸长率"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "热处理后圆度", "target": "热处理后实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "热处理后长度", "target": "热处理后实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "热处理后直线度", "target": "热处理后实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "热处理后力学性能", "target": "热处理后实际尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "drive",
                    "source": "热处理后标准尺寸", "target": "判定热处理信息"
                },
                {
                    "id": nanoid(),
                    "label": "drive",
                    "source": "热处理后实际尺寸", "target": "判定热处理信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "判定热处理信息", "target": "判定热处理合格"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "判定热处理信息", "target": "判定热处理不合格"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "判定热处理合格", "target": "流出"
                },
                {
                    "id": nanoid(),
                    "label": "execute",
                    "source": "判定热处理不合格", "target": "壳体整形"
                },
                {
                    "id": nanoid(),
                    "label": "execute",
                    "source": "壳体整形", "target": "效果验证"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "效果验证", "target": "重新判定"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "重新判定", "target": "判定热处理信息"
                },
                {
                    "id": nanoid(),
                    "label": "driven_by",
                    "source": "生产优化模型", "target": "热处理信息"
                },
                {
                    "id": nanoid(),
                    "label": "driven_by",
                    "source": "生产优化模型", "target": "质量信息测量"
                },
                {
                    "id": nanoid(),
                    "label": "execute",
                    "source": "生产优化模型", "target": "推荐工艺参数"
                },
                {
                    "id": nanoid(),
                    "label": "execute",
                    "source": "推荐工艺参数", "target": "热处理信息"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "壳体", "target": "工件"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "焊接工件1", "target": "壳体"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "焊接工件2", "target": "壳体"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体信息", "target": "壳体外形尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体信息", "target": "壳体标准模型"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体外形尺寸", "target": "外挂件"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体外形尺寸", "target": "吊挂"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体外形尺寸", "target": "弹簧支座"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体外形尺寸", "target": "旋牙筒体段"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体外形尺寸", "target": "前封头"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体外形尺寸", "target": "后封头"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体外形尺寸", "target": "后封头"
                },
                {
                    "id": nanoid(),
                    "label": "used_by",
                    "source": "壳体信息", "target": "匹配拟合"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "匹配拟合", "target": "不匹配"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "匹配拟合", "target": "匹配"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "不匹配", "target": "流出待工艺师处理"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "匹配", "target": "机外预调输入"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "机外预调输入", "target": "机外预调"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "机外预调", "target": "输出"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "输出", "target": "校调G代码"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "输出", "target": "壳体三维点云数据"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "校调G代码", "target": "机外预调数据库"
                },
                {
                    "id": nanoid(),
                    "label": "belong_to",
                    "source": "壳体三维点云数据", "target": "机外预调数据库"
                },
                {
                    "id": nanoid(),
                    "label": "used_by",
                    "source": "机外预调数据库", "target": "加工中心校调"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "加工中心校调", "target": "是否试切"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "是否试切", "target": "试切"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "是否试切", "target": "不试切"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "试切", "target": "燃烧室壳体加工"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "不试切", "target": "流出待工艺师处理"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "流出待工艺师处理", "target": "迭代优化"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "迭代优化", "target": "机外预调输入"
                },
                {
                    "id": nanoid(),
                    "label": "according_to",
                    "source": "校调G代码", "target": "壳体在机床上信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体在机床上信息", "target": "母线最高点距吊挂距离"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体在机床上信息", "target": "母线最高点距弹簧距离"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体在机床上信息", "target": "吊挂距中心距离"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "壳体在机床上信息", "target": "端面跳动"
                },
                {
                    "id": nanoid(),
                    "label": "according_to",
                    "source": "壳体在机床上信息", "target": "加工中心校调"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件信息", "target": "基本信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工件信息", "target": "工艺信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "基本信息", "target": "产品型号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "基本信息", "target": "产品图号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "基本信息", "target": "产品编号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工艺信息", "target": "工序号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工艺信息", "target": "加工方法"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工艺信息", "target": "检测方法"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "工艺信息", "target": "判定要求"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "工件信息", "target": "图像采集"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "图像采集", "target": "编码格式"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "图像采集", "target": "图像编号"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "图像采集", "target": "存储位置"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "图像采集", "target": "采集方式"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "采集方式", "target": "底片扫描"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "采集方式", "target": "数字成像"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "图像采集", "target": "图像缺陷采集"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "图像缺陷采集", "target": "缺陷信息"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "图像缺陷采集", "target": "缺陷图像"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷信息", "target": "缺陷位置"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷信息", "target": "缺陷数量"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷信息", "target": "缺陷性质"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷信息", "target": "缺陷尺寸"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "缺陷尺寸", "target": "判定结果"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "判定结果", "target": "判定不合格"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "判定结果", "target": "判定合格"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "判定不合格", "target": "人工复查"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "人工复查", "target": "生成报告"
                },
                {
                    "id": nanoid(),
                    "label": "apply",
                    "source": "缺陷图像", "target": "样本训练"
                },
                {
                    "id": nanoid(),
                    "label": "next_step",
                    "source": "样本训练", "target": "模型优化迭代"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷图像", "target": "烧穿缺陷图像"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷图像", "target": "气孔缺陷图像"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷图像", "target": "裂纹缺陷图像"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷图像", "target": "未焊透缺陷图像"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷图像", "target": "咬边缺陷图像"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷图像", "target": "弧坑缺陷图像"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷图像", "target": "凹陷缺陷图像"
                },
                {
                    "id": nanoid(),
                    "label": "contain",
                    "source": "缺陷图像", "target": "错边缺陷图像"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "烧穿缺陷图像", "target": "烧穿"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "气孔缺陷图像", "target": "气孔"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "裂纹缺陷图像", "target": "裂纹"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "未焊透缺陷图像", "target": "未焊透"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "咬边缺陷图像", "target": "咬边"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "弧坑缺陷图像", "target": "弧坑"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "凹陷缺陷图像", "target": "凹陷"
                },
                {
                    "id": nanoid(),
                    "label": "has_feature",
                    "source": "错边缺陷图像", "target": "错边"
                }







            ],
            width: 1000,
            height: 1000,
            colorList: ['#FD7623', '#3388B1', '#D82952', '#F3D737', '#409071', '#D64E52', "#fc5c9c", "#a1eafb", "#17b978", "#1e6262", "#a56cc1"],
        }
    }

    addGraph = () => {
        console.log(this.state.data)
        ConstructGraph(this.state.data)
    }
    render() {
        return (
            <div style={{ width: "100%", height: '100%' }}>
                <h2>| 薄壁壳体加工质量知识图谱概览</h2>

                <div style={{ width: "100%", height: '100%', overflow: 'hidden' }}>

                    <br />

                    <Search style={{ width: "100%" }} enterButton="查询" placeholder='MATCH(n) RETURN n LIMIT 100' onSearch={this.addGraph} />
                    <br />
                    <br />
                    <Card className="container" style={{ position: "relative", height: "86%", width: "100%", overflow: 'hidden' }}>

                    </Card>


                </div>
            </div>
        );
    }
}

export default QualityGraph;